app/controllers/photos_controller.rb

  def index
    @list_of_photos = Photo.all
---
SELECT "photos".* FROM "photos"

  def create_row
    p = Photo.new
    p.caption = params[:the_caption]
    p.source = params[:the_source]
    p.save
---
INSERT INTO "photos" ("caption", "source", "created_at", "updated_at") VALUES (?, ?, ?, ?)

  def destroy
    x = Photo.find_by({ :id => params[:id]})
    x.destroy
---
DELETE FROM "photos" WHERE "photos"."id" = ?  [["id", 12]]

  def update_row
    y= Photo.find_by({ :id => params[:id]})
    y.caption = params[:the_caption]
    y.source = params[:the_source]
    y.save
---
UPDATE "photos" SET "caption" = ?, "updated_at" = ? WHERE "photos"."id" = ?  [["caption", "Cueva de los Verdes 2"], ["updated_at", "2016-05-05 05:26:19.743849"], ["id", 3]]